[
    {
      "date": "April 11",
      "eventName": "National Pet Day",
      "celebratedFor": "Celebrating the joy and unconditional love pets bring to our lives."
    },
    {
      "date": "June 8",
      "eventName": "World Oceans Day",
      "celebratedFor": "Raising awareness about protecting marine life and habitats."
    },
    {
      "date": "October 4",
      "eventName": "World Animal Day",
      "celebratedFor": "Recognizing the importance of animal rights and welfare worldwide."
    },
    {
      "date": "December 10",
      "eventName": "International Animal Rights Day",
      "celebratedFor": "Promoting the protection and ethical treatment of animals globally."
    },
    {
      "date": "March 23",
      "eventName": "National Puppy Day",
      "celebratedFor": "Encouraging adoption and raising awareness about puppy mills."
    },
    
      {
        "date": "March 3",
        "eventName": "World Wildlife Day",
        "celebratedFor": "Celebrates and raises awareness about the world’s wild animals and plants."
      },
      
      {
        "date": "First Sunday in June",
        "eventName": "National Animal Rights Day",
        "celebratedFor": "Raises awareness about animal rights and aims to establish a world where animals are no longer exploited."
      },
      {
        "date": "Varies (usually in April)",
        "eventName": "Animal Advocacy Week",
        "celebratedFor": "Focuses on promoting legislative action on behalf of animals and educating the public on animal welfare issues."
      },
      {
        "date": "First full week of May",
        "eventName": "Be Kind to Animals Week",
        "celebratedFor": "Encourages compassion and understanding toward animals, and focuses on cruelty prevention."
      },
      {
        "date": "April 11",
        "eventName": "National Pet Day",
        "celebratedFor": "Raises awareness for pet adoption, supports animal shelters, and encourages kindness to animals."
      },
      {
        "date": "April 30",
        "eventName": "Adopt a Shelter Pet Day",
        "celebratedFor": "Encourages pet adoption and highlights the importance of giving homeless animals a second chance."
      },
      {
        "date": "Typically in October",
        "eventName": "Farm Animal Awareness Week",
        "celebratedFor": "Promotes awareness about the treatment of farm animals, encouraging humane practices."
      },
      {
        "date": "Last Tuesday in February",
        "eventName": "World Spay Day",
        "celebratedFor": "Raises awareness about the importance of spaying and neutering pets to prevent overpopulation and animal suffering."
      },
      {
        "date": "August 26",
        "eventName": "National Dog Day",
        "celebratedFor": "Celebrates dogs and highlights the need for adoption and the protection of animals."
      },
      {
        "date": "July 26",
        "eventName": "International Day for the Conservation of the Mangrove Ecosystem",
        "celebratedFor": "Focuses on the conservation of mangrove ecosystems, which are critical for biodiversity, including various species of animals."
      },
      {
        "date": "Third Saturday of February",
        "eventName": "World Pangolin Day",
        "celebratedFor": "Raises awareness about pangolin conservation, as they are one of the most trafficked animals in the world."
      },
      {
        "date": "August 12",
        "eventName": "World Elephant Day",
        "celebratedFor": "Focuses on raising awareness about the conservation of elephants and ending their exploitation."
      },
      {
        "date": "September",
        "eventName": "Save the Koala Month",
        "celebratedFor": "Aimed at raising funds and awareness for koala conservation efforts."
      },
      {
        "date": "June 16",
        "eventName": "World Sea Turtle Day",
        "celebratedFor": "Raises awareness of the challenges sea turtles face and promotes conservation efforts."
      }
    ]
    